In [96]:
# Import packages
import pandas as pd
import numpy as np

In [97]:
#Assignment:   
# Pre-defined lists
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right =[True, False, False, False, True, True, True]
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
row_labels = ['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG']

In [98]:
#step 1: Create dictionary my_dict with three key:value pairs:
new_dict = {
    'country':country,
    'drives_right':drives_right,
    'cars_per_cap':cars_per_cap,
    'row_labels': row_labels }

In [99]:
#step 2 Build a DataFrame cars from my_dict: cars
cars = pd.DataFrame(new_dict)

In [100]:
#step 3 print cars
cars

         country  drives_right  cars_per_cap row_labels
0  United States          True           809         US
1      Australia         False           731        AUS
2          Japan         False           588        JPN
3          India         False            18         IN
4         Russia          True           200         RU
5        Morocco          True            70        MOR
6          Egypt          True            45         EG

In [101]:
#step 4 specify the row labels of cars
cars.set_index('row_labels', inplace=True)

In [102]:
#step 5 print cars again
cars

                  country  drives_right  cars_per_cap
row_labels
US          United States          True           809
AUS             Australia         False           731
JPN                 Japan         False           588
IN                  India         False            18
RU                 Russia          True           200
MOR               Morocco          True            70
EG                  Egypt          True            45

In [103]:
#step 6 Print out country column as Pandas Series
cars['country']

row_labels
US     United States
AUS        Australia
JPN            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [104]:
#step 7 Print out country column as Pandas DataFrame
cars[['country']]

                  country
row_labels
US          United States
AUS             Australia
JPN                 Japan
IN                  India
RU                 Russia
MOR               Morocco
EG                  Egypt

In [105]:
#step 8 Print out DataFrame with country and drives_right columns
cars[['country', 'drives_right']]

                  country  drives_right
row_labels
US          United States          True
AUS             Australia         False
JPN                 Japan         False
IN                  India         False
RU                 Russia          True
MOR               Morocco          True
EG                  Egypt          True

In [106]:
#step 9 Print out first 3 observations
cars[0:3]

                  country  drives_right  cars_per_cap
row_labels
US          United States          True           809
AUS             Australia         False           731
JPN                 Japan         False           588

In [107]:
#step 10 Print out fourth, fifth and sixth observation
cars[3:6]

            country  drives_right  cars_per_cap
row_labels
IN            India         False            18
RU           Russia          True           200
MOR         Morocco          True            70

In [110]:
#step 11 Print out observation for Japan
cars[cars['country'] =='japan']

Empty DataFrame
Columns: [country, drives_right, cars_per_cap]
Index: []

In [111]:
#step 12 Print out observations for Australia and Egypt
cars[cars.country.isin(['Australia', 'Egypt'])]

              country  drives_right  cars_per_cap
row_labels
AUS         Australia         False           731
EG              Egypt          True            45

In [112]:
#step 12 Print out observations for Australia and Egypt
cars.loc[['AUS', 'EG']]

              country  drives_right  cars_per_cap
row_labels
AUS         Australia         False           731
EG              Egypt          True            45

In [114]:
#step 13 Print out drives_right value of Morocco
cars.loc[cars.country == 'Morocco', ['drives_right']]

            drives_right
row_labels
MOR                 True

In [116]:
#step 13 Print out drives_right value of Morocco
cars.loc[['MOR'], ['drives_right']]

            drives_right
row_labels
MOR                 True